ratemygym/app/views/reviews/index.html.erb

        <div id="reviewsList">
          <% if @gym.reviews.any? %>
            <% @gym.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."gym_id" = $1  [["gym_id", 2]]