ratemygym/app/controllers/gyms_controller.rb

SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."gym_id" = $1 ORDER BY "reviews"."created_at" DESC  [["gym_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."gym_id" = $1  [["gym_id", 1]]
SELECT AVG("reviews"."staff_rating") FROM "reviews" WHERE "reviews"."gym_id" = $1  [["gym_id", 1]]
SELECT AVG("reviews"."location_rating") FROM "reviews" WHERE "reviews"."gym_id" = $1  [["gym_id", 1]]
SELECT AVG("reviews"."location_rating") FROM "reviews" WHERE "reviews"."gym_id" = $1  [["gym_id", 2]]
SELECT AVG("reviews"."atmosphere_rating") FROM "reviews" WHERE "reviews"."gym_id" = $1  [["gym_id", 1]]
---
  def show
    @gym = Gym.find(params[:id])
    @reviews = @gym.reviews.order(created_at: :desc)

     # Calculate averages of each section rounded to one decimal place
     @average_machines_rating = @reviews.average(:rating).to_f.round(1)
     @average_staff_rating = @reviews.average(:staff_rating).to_f.round(1)
     @average_location_rating = @reviews.average(:location_rating).to_f.round(1)
     @average_cleanliness_rating = @reviews.average(:clean_rating).to_f.round(1)
     @average_atmosphere_rating = @reviews.average(:atmosphere_rating).to_f.round(1)