ratemygym/app/controllers/reviews_controller.rb

  def index
    @gym = Gym.find(params[:gym_id])
---
SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @gym = Gym.find(params[:gym_id])
    @review = @gym.reviews.new(review_params)
    @review.user_id = current_user.id  # Assign the current user's ID to the review

    if @review.save
---
SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("gym_id", "user_id", "rating", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["gym_id", 1], ["user_id", 1], ["rating", 5], ["comment", "This is a good gym!"], ["created_at", "2024-09-27 00:18:50.467570"], ["updated_at", "2024-09-27 00:18:50.467570"]]