ratemygym/app/controllers/reviews_controller.rb

  def create
    @review = @gym.reviews.new(review_params)
    @review.user_id = current_user.id  # Assign the current user's ID to the review

    # Specify the required fields you want to check for presence
    required_fields = %w[rating staff_rating location_rating clean_rating atmosphere_rating comment]
    missing_fields = required_fields.select { |field| @review.send(field).blank? }

    if missing_fields.any?
      # If any required fields are blank, respond with an error
      respond_to do |format|
        format.js { render js: "alert('Please fill all fields before submitting the review')" }
        format.html { redirect_to gym_path(@gym), alert: "Please fill in all required(*) fields before submitting the review" }
      end
    else
      if @review.save
---
INSERT INTO "reviews" ("gym_id", "user_id", "rating", "comment", "created_at", "updated_at", "staff_rating", "location_rating", "clean_rating", "atmosphere_rating", "opinion") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "m, .,"], ["updated_at", "2024-10-29 04:02:16.657536"], ["id", 8]]

  def set_gym
    @gym = Gym.find(params[:gym_id])
---
SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def set_review
    @review = @gym.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."gym_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["gym_id", 2], ["id", 8], ["LIMIT", 1]]