ratemygym/app/controllers/reviews_controller.rb

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "sdsdsdsdsdsd"], ["updated_at", "2024-10-28 08:01:57.896636"], ["id", 2]]

  def set_gym
    @gym = Gym.find(params[:gym_id])
---
SELECT "gyms".* FROM "gyms" WHERE "gyms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_review
    @review = @gym.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."gym_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["gym_id", 1], ["id", 3], ["LIMIT", 1]]